FL0WL0W/KernelMPC5674F/src/MPC5674FFlashService.cpp
#include "MPC5674FFlashService.h"

#include <new>

namespace
{
	enum class BlockArea : std::uint8_t
	{
		ALow,
		AMid,
		BLow,
		BMid,
		High,
	};

	struct FlashBlock
	{
		std::uint32_t Address;
		std::uint32_t Length;
		BlockArea Area;
		std::uint8_t HardwareIndex;
	};

	// The high blocks are logical 512 KiB blocks. Each is composed of a
	// 256 KiB block in Flash A and a 256 KiB block in Flash B, interleaved in
	// 16-byte halves of each 32-byte logical line.
	constexpr FlashBlock FlashBlocks[] = {
		{0x00000000U, 0x00004000U, BlockArea::ALow, 0U},
		{0x00004000U, 0x00004000U, BlockArea::ALow, 1U},
		{0x00008000U, 0x00004000U, BlockArea::ALow, 2U},
		{0x0000C000U, 0x00004000U, BlockArea::ALow, 3U},
		{0x00010000U, 0x00004000U, BlockArea::ALow, 4U},
		{0x00014000U, 0x00004000U, BlockArea::ALow, 5U},
		{0x00018000U, 0x00004000U, BlockArea::ALow, 6U},
		{0x0001C000U, 0x00004000U, BlockArea::ALow, 7U},
		{0x00020000U, 0x00010000U, BlockArea::ALow, 8U},
		{0x00030000U, 0x00010000U, BlockArea::ALow, 9U},
		{0x00040000U, 0x00020000U, BlockArea::AMid, 0U},
		{0x00060000U, 0x00020000U, BlockArea::AMid, 1U},
		{0x00080000U, 0x00040000U, BlockArea::BLow, 0U},
		{0x000C0000U, 0x00040000U, BlockArea::BMid, 0U},
		{0x00100000U, 0x00080000U, BlockArea::High, 0U},
		{0x00180000U, 0x00080000U, BlockArea::High, 1U},
		{0x00200000U, 0x00080000U, BlockArea::High, 2U},
		{0x00280000U, 0x00080000U, BlockArea::High, 3U},
		{0x00300000U, 0x00080000U, BlockArea::High, 4U},
		{0x00380000U, 0x00080000U, BlockArea::High, 5U},
	};

	constexpr std::size_t FlashBlockCount =
		sizeof(FlashBlocks) / sizeof(FlashBlocks[0]);
	static_assert(FlashBlockCount == 20U, "Unexpected MPC5674F block count");

	constexpr std::uint32_t FlashEnd = 0x00400000U;
	constexpr std::uint32_t LowMidLockPassword = 0xA1A11111U;
	constexpr std::uint32_t SecondaryLockPassword = 0xC3C33333U;
	constexpr std::uint32_t HighLockPassword = 0xB2B22222U;
	constexpr std::uint32_t ProgramPageSize = 16U;
	constexpr std::uint32_t ECCSegmentSize = 8U;

	// These factory/reserved doublewords are known to be unreadable when their
	// ECC syndrome has never been programmed. Hash them as erased without ever
	// issuing a flash-bus read.
	constexpr std::uint32_t InvalidECCAddresses[] = {
		0x0001FFF8U,
		0x0002FFF8U,
	};

	bool IsInvalidECCAddress(std::uint32_t address)
	{
		for (std::uint32_t invalid : InvalidECCAddresses)
		{
			if (address >= invalid && address < invalid + ECCSegmentSize)
				return true;
		}
		return false;
	}

	void Synchronize()
	{
		asm volatile("msync" ::: "memory");
	}

	void WriteBigEndian32(std::uint8_t* destination, std::uint32_t value)
	{
		destination[0] = static_cast<std::uint8_t>(value >> 24U);
		destination[1] = static_cast<std::uint8_t>(value >> 16U);
		destination[2] = static_cast<std::uint8_t>(value >> 8U);
		destination[3] = static_cast<std::uint8_t>(value);
	}

	std::uint32_t ReadBigEndian32(const std::uint8_t* source)
	{
		return (static_cast<std::uint32_t>(source[0]) << 24U) |
			(static_cast<std::uint32_t>(source[1]) << 16U) |
			(static_cast<std::uint32_t>(source[2]) << 8U) |
			static_cast<std::uint32_t>(source[3]);
	}

	std::size_t FindBlock(std::uint32_t address)
	{
		for (std::size_t i = 0U; i < FlashBlockCount; ++i)
		{
			const FlashBlock& block = FlashBlocks[i];
			if (address >= block.Address &&
				address < block.Address + block.Length)
				return i;
		}
		return FlashBlockCount;
	}

	bool IsFlashRange(std::uint32_t address, std::size_t length)
	{
		if (length == 0U || length > 0xFFFFFFFFU)
			return false;
		const std::uint32_t end =
			address + static_cast<std::uint32_t>(length);
		return address < FlashEnd && end > address && end <= FlashEnd;
	}

	bool ControllerIdle(volatile struct FLASH_tag& flash)
	{
		return flash.MCR.B.PGM == 0U && flash.MCR.B.ERS == 0U &&
			flash.MCR.B.EHV == 0U && flash.MCR.B.DONE != 0U;
	}

	void RestoreLocks(volatile struct FLASH_tag& flash,
		std::uint32_t lmlr, std::uint32_t slmlr, std::uint32_t hlr)
	{
		flash.LMLR.B.SLOCK = (lmlr >> 20U) & 1U;
		flash.LMLR.B.MLOCK = (lmlr >> 16U) & 3U;
		flash.LMLR.B.LLOCK = lmlr & 0x3FFU;
		flash.SLMLR.B.SSLOCK = (slmlr >> 20U) & 1U;
		flash.SLMLR.B.SMLOCK = (slmlr >> 16U) & 3U;
		flash.SLMLR.B.SLLOCK = slmlr & 0x3FFU;
		flash.HLR.B.HBLOCK = hlr & 0x3FU;
	}

	bool SequenceBefore(std::uint32_t left, std::uint32_t right)
	{
		return static_cast<std::int32_t>(left - right) < 0;
	}
}

namespace E92
{
	MPC5674FFlashService::Controller
	MPC5674FFlashService::ControllerForAddress(std::uint32_t address)
	{
		if (address < 0x00080000U)
			return Controller::A;
		if (address < 0x00100000U)
			return Controller::B;
		return (address & 0x10U) == 0U ? Controller::A : Controller::B;
	}

	volatile struct FLASH_tag& MPC5674FFlashService::FlashController(
		Controller controller)
	{
		return controller == Controller::A ? FLASH_A : FLASH_B;
	}

	void MPC5674FFlashService::SendNegative(
		const EmbeddedIOServices::communication_send_callback_t& send,
		std::uint8_t code) const
	{
		const std::uint8_t response[] = {0x7FU, 0x31U, code};
		send(response, sizeof(response));
	}

	void MPC5674FFlashService::SendEraseStatus(
		const EmbeddedIOServices::communication_send_callback_t& send,
		std::uint8_t block,
		EraseStatus status) const
	{
		const std::uint8_t response[] = {
			0x71U,
			0x01U,
			static_cast<std::uint8_t>(EraseRoutineIdentifier >> 8U),
			static_cast<std::uint8_t>(EraseRoutineIdentifier),
			block,
			static_cast<std::uint8_t>(status),
		};
		send(response, sizeof(response));
	}

	void MPC5674FFlashService::QueueErase(
		std::uint8_t block,
		const EmbeddedIOServices::communication_send_callback_t& send)
	{
		// Treat a repeated request as a status query. This makes retrying a lost
		// UDS response safe without erasing the same block twice.
		for (std::size_t offset = 0U; offset < _eraseQueueCount; ++offset)
		{
			const std::size_t index = (_eraseQueueHead + offset) % BlockCount;
			if (_eraseQueue[index].Block != block)
				continue;
			const bool running = offset == 0U &&
				(_operation == Operation::EraseStart ||
				 _operation == Operation::EraseWait);
			SendEraseStatus(send, block,
				running ? EraseStatus::Running : EraseStatus::Queued);
			return;
		}

		if (_eraseQueueCount == BlockCount)
		{
			SendEraseStatus(send, block, EraseStatus::Failed);
			return;
		}

		const std::size_t tail =
			(_eraseQueueHead + _eraseQueueCount) % BlockCount;
		_eraseQueue[tail].Block = block;
		_eraseQueue[tail].Sequence = _nextOperationSequence++;
		_eraseQueue[tail].Send = send;
		++_eraseQueueCount;
		SendEraseStatus(send, block, EraseStatus::Queued);
	}

