FL0WL0W/KernelMPC5674F/src/MPC5674FFlashService.cpp
	void MPC5674FFlashService::BeginErase(std::uint32_t now)
	{
		_eraseBlock = _eraseQueue[_eraseQueueHead].Block;
		_erasePhase = 0U;
		_lastStatusTime = now;
		CancelHash(_eraseBlock);
		SendEraseStatus(_eraseQueue[_eraseQueueHead].Send,
			_eraseBlock, EraseStatus::Running);
		_operation = Operation::EraseStart;
	}

	bool MPC5674FFlashService::OpenController(
		Controller controller, std::uint8_t blockIndex)
	{
		if (controller == Controller::None || blockIndex >= BlockCount ||
			_controllerSnapshot.Valid)
			return false;

		volatile struct FLASH_tag& flash = FlashController(controller);
		if (!ControllerIdle(flash))
			return false;

		const FlashBlock& block = FlashBlocks[blockIndex];
		_controllerSnapshot.BIUCR = flash.BIUCR.R;
		_controllerSnapshot.LMLR = flash.LMLR.R;
		_controllerSnapshot.SLMLR = flash.SLMLR.R;
		_controllerSnapshot.HLR = flash.HLR.R;
		_controllerSnapshot.Valid = true;

		flash.BIUCR.B.IPFEN = 0U;
		flash.BIUCR.B.DPFEN = 0U;
		Synchronize();

		if (block.Area == BlockArea::High)
		{
			flash.HLR.R = HighLockPassword;
			flash.HLR.B.HBLOCK &= ~(1UL << block.HardwareIndex);
			if ((flash.HLR.B.HBLOCK & (1UL << block.HardwareIndex)) != 0U)
				return false;
		}
		else
		{
			flash.LMLR.R = LowMidLockPassword;
			flash.SLMLR.R = SecondaryLockPassword;
			if (block.Area == BlockArea::ALow || block.Area == BlockArea::BLow)
			{
				flash.LMLR.B.LLOCK &= ~(1UL << block.HardwareIndex);
				flash.SLMLR.B.SLLOCK &= ~(1UL << block.HardwareIndex);
				if ((flash.LMLR.B.LLOCK & (1UL << block.HardwareIndex)) != 0U ||
					(flash.SLMLR.B.SLLOCK & (1UL << block.HardwareIndex)) != 0U)
					return false;
			}
			else
			{
				flash.LMLR.B.MLOCK &= ~(1UL << block.HardwareIndex);
				flash.SLMLR.B.SMLOCK &= ~(1UL << block.HardwareIndex);
				if ((flash.LMLR.B.MLOCK & (1UL << block.HardwareIndex)) != 0U ||
					(flash.SLMLR.B.SMLOCK & (1UL << block.HardwareIndex)) != 0U)
					return false;
			}
		}
		Synchronize();
		return true;
	}

	void MPC5674FFlashService::CloseController(bool programming)
	{
		const Controller controller = programming
			? _programController : _eraseController;
		if (controller == Controller::None)
			return;
		if (!_controllerSnapshot.Valid)
		{
			if (programming)
				_programController = Controller::None;
			else
				_eraseController = Controller::None;
			return;
		}

		volatile struct FLASH_tag& flash = FlashController(controller);
		flash.MCR.B.EHV = 0U;
		Synchronize();
		if (programming)
			flash.MCR.B.PGM = 0U;
		else
		{
			flash.LMSR.R = 0U;
			flash.HSR.R = 0U;
			flash.MCR.B.ERS = 0U;
		}
		Synchronize();

		RestoreLocks(flash,
			_controllerSnapshot.LMLR,
			_controllerSnapshot.SLMLR,
			_controllerSnapshot.HLR);
		// Toggling BFEN invalidates stale line-buffer contents before restoring
		// the original prefetch configuration.
		flash.BIUCR.B.BFEN = 0U;
		Synchronize();
		flash.BIUCR.R = _controllerSnapshot.BIUCR;
		Synchronize();

		_controllerSnapshot = ControllerSnapshot();
		if (programming)
			_programController = Controller::None;
		else
			_eraseController = Controller::None;
	}

	void MPC5674FFlashService::StartErasePhase()
	{
		const FlashBlock& block = FlashBlocks[_eraseBlock];
		if (block.Area == BlockArea::High)
			_eraseController = _erasePhase == 0U ? Controller::A : Controller::B;
		else if (block.Area == BlockArea::ALow || block.Area == BlockArea::AMid)
			_eraseController = Controller::A;
		else
			_eraseController = Controller::B;

		if (!OpenController(_eraseController, _eraseBlock))
		{
			CompleteErase(EraseStatus::Failed);
			return;
		}

		volatile struct FLASH_tag& flash = FlashController(_eraseController);
		flash.MCR.B.ERS = 1U;
		if (block.Area == BlockArea::High)
			flash.HSR.B.HBSEL = 1UL << block.HardwareIndex;
		else if (block.Area == BlockArea::ALow || block.Area == BlockArea::BLow)
			flash.LMSR.B.LSEL = 1UL << block.HardwareIndex;
		else
			flash.LMSR.B.MSEL = 1UL << block.HardwareIndex;

		// Bit 4 selects the physical half of an interleaved high-flash line.
		const std::uint32_t interlockAddress = block.Address +
			((block.Area == BlockArea::High &&
			  _eraseController == Controller::B) ? 0x10U : 0U);
		*reinterpret_cast<volatile std::uint32_t*>(interlockAddress) = 0xFFFFFFFFU;
		Synchronize();
		flash.MCR.B.EHV = 1U;
		Synchronize();
		_operation = Operation::EraseWait;
	}

	void MPC5674FFlashService::WaitForErase()
	{
		volatile struct FLASH_tag& flash = FlashController(_eraseController);
		if (flash.MCR.B.DONE == 0U)
			return;

		const bool successful = flash.MCR.B.PEG != 0U;
		CloseController(false);
		if (!successful)
		{
			CompleteErase(EraseStatus::Failed);
			return;
		}

		if (FlashBlocks[_eraseBlock].Area == BlockArea::High && _erasePhase == 0U)
		{
			_erasePhase = 1U;
			_operation = Operation::EraseStart;
			return;
		}
		CompleteErase(EraseStatus::Successful);
	}

	void MPC5674FFlashService::CompleteErase(EraseStatus status)
	{
		if (_eraseController != Controller::None)
			CloseController(false);
		const bool successful = status == EraseStatus::Successful;
		MarkEraseResult(_eraseBlock, successful);

		EraseRequest& request = _eraseQueue[_eraseQueueHead];
		SendEraseStatus(request.Send, request.Block, status);
		request = EraseRequest();
		_eraseQueueHead = (_eraseQueueHead + 1U) % BlockCount;
		--_eraseQueueCount;
		_operation = Operation::Idle;
	}

	bool MPC5674FFlashService::QueueWrite(
		std::uint32_t address,
		const std::uint8_t* data,
		std::size_t length,
		UDSFlashWriteCompletion completion)
	{
		if (data == nullptr || !completion || length > MaximumWriteLength ||
			!IsFlashRange(address, length) || (address & 7U) != 0U ||
			(length & 7U) != 0U)
			return false;

		std::uint8_t* const copy = new (std::nothrow) std::uint8_t[length];
		if (copy == nullptr)
			return false;
		for (std::size_t i = 0U; i < length; ++i)
			copy[i] = data[i];

		ProgramRequest request;
		request.Address = address;
		request.Length = length;
		request.Data = copy;
		request.Sequence = _nextOperationSequence++;
		request.Completion = completion;

		if (_activeProgram.Data == nullptr)
			_activeProgram = request;
		else if (_queuedProgram.Data == nullptr)
			_queuedProgram = request;
		else
		{
			delete[] copy;
			return false;
		}
		return true;
	}

