FL0WL0W/KernelMPC5674F/src/MPC5674FFlashService.cpp
	void MPC5674FFlashService::BeginProgram()
	{
		_programOffset = 0U;
		_programNextOffset = 0U;
		_programBlock = static_cast<std::uint8_t>(FindBlock(_activeProgram.Address));
		_lastStatusTime = 0U;
		_operation = _programBlock < BlockCount
			? Operation::ProgramStart : Operation::Idle;
		if (_programBlock >= BlockCount)
			CompleteProgram(false);
	}

	void MPC5674FFlashService::StartProgramPage()
	{
		const std::uint32_t address = _activeProgram.Address +
			static_cast<std::uint32_t>(_programOffset);
		const std::size_t blockIndex = FindBlock(address);
		if (blockIndex == BlockCount)
		{
			CompleteProgram(false);
			return;
		}

		const Controller targetController = ControllerForAddress(address);
		if (_programController != targetController || _programBlock != blockIndex)
		{
			if (_programController != Controller::None)
				CloseController(true);
			_programController = targetController;
			_programBlock = static_cast<std::uint8_t>(blockIndex);
			if (!OpenController(_programController, _programBlock))
			{
				CompleteProgram(false);
				return;
			}
		}

		const std::uint32_t pageEnd =
			(address & ~(ProgramPageSize - 1U)) + ProgramPageSize;
		const std::size_t remaining = _activeProgram.Length - _programOffset;
		const std::size_t pageLength = remaining < pageEnd - address
			? remaining : pageEnd - address;
		std::uint8_t programMask = 0U;

		for (std::size_t offset = 0U; offset < pageLength; offset += ECCSegmentSize)
		{
			const std::uint8_t* const desired =
				_activeProgram.Data + _programOffset + offset;
			bool equal = true;
			bool erased = true;
			if (IsInvalidECCAddress(address + offset))
			{
				// Reading this segment can machine-check. FF needs no operation;
				// non-FF is permitted after the explicit block erase protocol.
				for (std::size_t byte = 0U; byte < ECCSegmentSize; ++byte)
					equal = equal && desired[byte] == 0xFFU;
			}
			else
			{
				const volatile std::uint8_t* const current =
					reinterpret_cast<const volatile std::uint8_t*>(address + offset);
				for (std::size_t byte = 0U; byte < ECCSegmentSize; ++byte)
				{
					equal = equal && current[byte] == desired[byte];
					erased = erased && current[byte] == 0xFFU;
				}
			}
			if (equal)
				continue;
			if (!erased)
			{
				CompleteProgram(false);
				return;
			}
			programMask |= static_cast<std::uint8_t>(1U << (offset / ECCSegmentSize));
		}

		_programNextOffset = _programOffset + pageLength;
		if (programMask == 0U)
		{
			_programOffset = _programNextOffset;
			if (_programOffset == _activeProgram.Length)
				CompleteProgram(true);
			return;
		}

		volatile struct FLASH_tag& flash = FlashController(_programController);
		flash.MCR.B.PGM = 1U;
		Synchronize();
		for (std::size_t offset = 0U; offset < pageLength; offset += ECCSegmentSize)
		{
			if ((programMask & (1U << (offset / ECCSegmentSize))) == 0U)
				continue;
			const std::uint8_t* const desired =
				_activeProgram.Data + _programOffset + offset;
			volatile std::uint32_t* const destination =
				reinterpret_cast<volatile std::uint32_t*>(address + offset);
			destination[0] = ReadBigEndian32(desired);
			destination[1] = ReadBigEndian32(desired + 4U);
		}
		Synchronize();
		flash.MCR.B.EHV = 1U;
		Synchronize();
		_operation = Operation::ProgramWait;
	}

	void MPC5674FFlashService::WaitForProgram()
	{
		volatile struct FLASH_tag& flash = FlashController(_programController);
		if (flash.MCR.B.DONE == 0U)
			return;
		const bool successful = flash.MCR.B.PEG != 0U;
		flash.MCR.B.EHV = 0U;
		Synchronize();
		flash.MCR.B.PGM = 0U;
		Synchronize();
		if (!successful)
		{
			CompleteProgram(false);
			return;
		}

		_programOffset = _programNextOffset;
		if (_programOffset == _activeProgram.Length)
			CompleteProgram(true);
		else
			_operation = Operation::ProgramStart;
	}

	void MPC5674FFlashService::CompleteProgram(bool successful)
	{
		if (_programController != Controller::None)
			CloseController(true);
		MarkProgramResult(successful);

		UDSFlashWriteCompletion completion = _activeProgram.Completion;
		delete[] _activeProgram.Data;
		_activeProgram = _queuedProgram;
		_queuedProgram = ProgramRequest();
		_operation = Operation::Idle;
		if (completion)
			completion(successful);
	}

	void MPC5674FFlashService::MarkEraseResult(
		std::uint8_t block, bool successful)
	{
		CancelHash(block);
		if (successful)
		{
			_cacheStatus[block] = CacheStatus::ErasedAwaitingRewrite;
			_rewriteThrough[block] = FlashBlocks[block].Address;
		}
		else
		{
			_cacheStatus[block] = CacheStatus::NeedsHash;
		}
	}

	void MPC5674FFlashService::MarkProgramResult(bool successful)
	{
		if (_activeProgram.Data == nullptr || _activeProgram.Length == 0U)
			return;
		const std::uint32_t requestStart = _activeProgram.Address;
		const std::uint32_t requestEnd = requestStart +
			static_cast<std::uint32_t>(_activeProgram.Length);

		for (std::size_t i = 0U; i < BlockCount; ++i)
		{
			const FlashBlock& block = FlashBlocks[i];
			const std::uint32_t blockEnd = block.Address + block.Length;
			const std::uint32_t writeStart = requestStart > block.Address
				? requestStart : block.Address;
			const std::uint32_t writeEnd = requestEnd < blockEnd
				? requestEnd : blockEnd;
			if (writeStart >= writeEnd)
				continue;

			CancelHash(static_cast<std::uint8_t>(i));
			if (!successful)
			{
				_cacheStatus[i] = CacheStatus::NeedsHash;
				continue;
			}
			if (_cacheStatus[i] != CacheStatus::ErasedAwaitingRewrite)
			{
				_cacheStatus[i] = CacheStatus::NeedsHash;
				continue;
			}

			if (writeStart <= _rewriteThrough[i] && writeEnd > _rewriteThrough[i])
				_rewriteThrough[i] = writeEnd;
			if (_rewriteThrough[i] >= blockEnd)
				_cacheStatus[i] = CacheStatus::NeedsHash;
		}
	}

	void MPC5674FFlashService::StartHash(std::uint8_t block)
	{
		_hashBlock = block;
		_hashOffset = 0U;
		_hashActive = true;
		_sha256.Reset();
	}

	void MPC5674FFlashService::CancelHash(std::uint8_t block)
	{
		if (_hashActive && _hashBlock == block)
			_hashActive = false;
	}

	void MPC5674FFlashService::ServiceHash()
	{
		const FlashBlock& block = FlashBlocks[_hashBlock];
		const std::uint32_t remaining = block.Length - _hashOffset;
		const std::uint32_t count = remaining < HashBytesPerService
			? remaining : static_cast<std::uint32_t>(HashBytesPerService);
		std::uint32_t cursor = block.Address + _hashOffset;
		const std::uint32_t end = cursor + count;
		while (cursor < end)
		{
			if (IsInvalidECCAddress(cursor))
			{
				const std::uint8_t erased = 0xFFU;
				_sha256.Update(&erased, 1U);
				++cursor;
				continue;
			}

			std::uint32_t directEnd = end;
			for (std::uint32_t invalid : InvalidECCAddresses)
			{
				if (cursor < invalid && invalid < directEnd)
					directEnd = invalid;
			}
			_sha256.Update(
				reinterpret_cast<const volatile std::uint8_t*>(cursor),
				directEnd - cursor);
			cursor = directEnd;
		}

