FL0WL0W/KernelMPC5674F/src/MPC5674FFlashService.cpp
		_hashOffset += count;
		if (_hashOffset < block.Length)
			return;
		_sha256.Final(_hashCache[_hashBlock]);
		_cacheStatus[_hashBlock] = CacheStatus::Valid;
		_hashActive = false;
	}

	void MPC5674FFlashService::ServiceBackgroundHash()
	{
		if (!_hashActive)
		{
			for (std::size_t block = 0U; block < BlockCount; ++block)
			{
				if (_cacheStatus[block] != CacheStatus::NeedsHash)
					continue;
				StartHash(static_cast<std::uint8_t>(block));
				break;
			}
		}
		if (_hashActive)
			ServiceHash();
	}

	void MPC5674FFlashService::StartInventory()
	{
		_inventoryResponse[0] = 0x71U;
		_inventoryResponse[1] = 0x01U;
		_inventoryResponse[2] =
			static_cast<std::uint8_t>(InventoryRoutineIdentifier >> 8U);
		_inventoryResponse[3] =
			static_cast<std::uint8_t>(InventoryRoutineIdentifier);
		_inventoryResponse[4] = static_cast<std::uint8_t>(BlockCount);
		_inventoryBlock = 0U;
		_lastStatusTime = 0U;
		_inventoryActive = true;

		for (std::size_t block = 0U; block < BlockCount; ++block)
		{
			if (_cacheStatus[block] == CacheStatus::ErasedAwaitingRewrite)
				_cacheStatus[block] = CacheStatus::NeedsHash;
		}
		const std::uint8_t pending[] = {0x7FU, 0x31U, 0x78U};
		_inventorySend(pending, sizeof(pending));
	}

	void MPC5674FFlashService::ServiceInventory()
	{
		if (_cacheStatus[_inventoryBlock] != CacheStatus::Valid)
		{
			if (!_hashActive)
				StartHash(_inventoryBlock);
			ServiceHash();
			return;
		}
		if (!_communicationReady)
			return;

		const FlashBlock& block = FlashBlocks[_inventoryBlock];
		constexpr std::size_t record = 5U;
		_inventoryResponse[record] = _inventoryBlock;
		WriteBigEndian32(_inventoryResponse + record + 1U, block.Address);
		WriteBigEndian32(_inventoryResponse + record + 5U, block.Length);
		for (std::size_t i = 0U; i < HashLength; ++i)
			_inventoryResponse[record + 9U + i] = _hashCache[_inventoryBlock][i];
		_inventorySend(_inventoryResponse, sizeof(_inventoryResponse));

		++_inventoryBlock;
		_lastStatusTime = 0U;
		if (_inventoryBlock == BlockCount)
		{
			_inventorySend = EmbeddedIOServices::communication_send_callback_t();
			_inventoryActive = false;
		}
	}

	bool MPC5674FFlashService::HandleRoutineControl(
		std::uint8_t subFunction,
		std::uint16_t routineIdentifier,
		const std::uint8_t* optionRecord,
		std::size_t optionRecordLength,
		const EmbeddedIOServices::communication_send_callback_t& send)
	{
		if (routineIdentifier != InventoryRoutineIdentifier &&
			routineIdentifier != EraseRoutineIdentifier)
			return false;
		if (subFunction != 0x01U)
		{
			SendNegative(send, 0x12U);
			return true;
		}

		if (routineIdentifier == InventoryRoutineIdentifier)
		{
			if (optionRecordLength != 0U)
			{
				SendNegative(send, 0x13U);
				return true;
			}
			if (_inventoryActive || _operation != Operation::Idle ||
				_eraseQueueCount != 0U || _activeProgram.Data != nullptr)
			{
				SendNegative(send, 0x21U);
				return true;
			}
			_inventorySend = send;
			StartInventory();
			return true;
		}

		if (optionRecord == nullptr || optionRecordLength != 1U ||
			optionRecord[0] >= BlockCount)
		{
			SendNegative(send, optionRecordLength == 1U ? 0x31U : 0x13U);
			return true;
		}
		QueueErase(optionRecord[0], send);
		return true;
	}

	void MPC5674FFlashService::Service(
		std::uint32_t now, bool communicationReady)
	{
		_communicationReady = communicationReady;
		if (_operation == Operation::Idle && !_inventoryActive)
		{
			const bool eraseFirst = _eraseQueueCount != 0U &&
				(_activeProgram.Data == nullptr ||
				 SequenceBefore(_eraseQueue[_eraseQueueHead].Sequence,
					_activeProgram.Sequence));
			if (eraseFirst)
				BeginErase(now);
			else if (_activeProgram.Data != nullptr)
				BeginProgram();
		}

		if (_operation == Operation::EraseStart)
			StartErasePhase();
		else if (_operation == Operation::EraseWait)
			WaitForErase();
		else if (_operation == Operation::ProgramStart)
			StartProgramPage();
		else if (_operation == Operation::ProgramWait)
			WaitForProgram();

		if (_operation == Operation::EraseStart ||
			_operation == Operation::EraseWait)
		{
			if (static_cast<std::uint32_t>(now - _lastStatusTime) >=
				StatusPeriodTicks)
			{
				_lastStatusTime = now;
				SendEraseStatus(_eraseQueue[_eraseQueueHead].Send,
					_eraseQueue[_eraseQueueHead].Block, EraseStatus::Running);
			}
			return;
		}
		if (_operation != Operation::Idle)
			return;

		if (_inventoryActive)
		{
			if (_communicationReady && _lastStatusTime != 0U &&
				static_cast<std::uint32_t>(now - _lastStatusTime) >=
				StatusPeriodTicks)
			{
				_lastStatusTime = now;
				const std::uint8_t pending[] = {0x7FU, 0x31U, 0x78U};
				_inventorySend(pending, sizeof(pending));
				return;
			}
			if (_lastStatusTime == 0U)
				_lastStatusTime = now;
			ServiceInventory();
			return;
		}
		ServiceBackgroundHash();
	}

	bool MPC5674FFlashService::Ready() const
	{
		return _operation == Operation::Idle && _eraseQueueCount == 0U &&
			_activeProgram.Data == nullptr && !_inventoryActive;
	}
}
